In [7]:
import pandas as pd
menu = pd.Series(['비빔밥', '김치찌개', '된장찌개'])
price = pd.Series([10000, 9000, 8000])
# display(menu,price) 확인
# print(menu)
# print(price)

0     비빔밥
1    김치찌개
2    된장찌개
dtype: object

0    10000
1     9000
2     8000
dtype: int64

0     비빔밥
1    김치찌개
2    된장찌개
dtype: object
0    10000
1     9000
2     8000
dtype: int64

In [8]:
df_from_series = pd.DataFrame({
    '메뉴': menu,
    '가격': price
})
df_from_series

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [9]:
df = pd.DataFrame({
    '메뉴': ['비빔밥', '김치찌개', '된장찌개'],
    '가격': [10000, 9000, 8000],
    '원산지': ['국내산', '국내산', '국내산']
})
df

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌개   9000  국내산
2  된장찌개   8000  국내산

In [17]:
menu_series = df['메뉴']     # 타입: pandas.Series
menu_series
#type(menu_series)

0     비빔밥
1    김치찌개
2    된장찌개
Name: 메뉴, dtype: object

In [19]:
menu_df = df[['메뉴']]       # 타입: pandas.DataFrame
menu_df
#type(menu_df)

     메뉴
0   비빔밥
1  김치찌개
2  된장찌개

In [14]:
menu_price_df = df[['메뉴', '가격']]
menu_price_df

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [15]:
cols = ['메뉴', '가격']
menu_price_df2 = df[cols]
menu_price_df2

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [20]:
print('df          : ', type(df))
print("df['가격']   : ", type(df['가격']))     # Series
print("df[['가격']] : ", type(df[['가격']]))   # DataFrame

df          :  <class 'pandas.core.frame.DataFrame'>
df['가격']   :  <class 'pandas.core.series.Series'>
df[['가격']] :  <class 'pandas.core.frame.DataFrame'>

In [21]:
# 예: 10% 할인 가격 컬럼 추가
df['할인가'] = (df['가격'] * 0.9).astype(int)

In [22]:
# 예: '김치찌개' 가격 9500으로 변경
df.loc[df['메뉴'] == '김치찌개', '가격'] = 9500

In [23]:
menu_price_df2

     메뉴     가격
0   비빔밥  10000
1  김치찌개   9000
2  된장찌개   8000

In [25]:
cols = ['메뉴', '가격','할인가']
menu_price_df3 = df[cols]
menu_price_df3

     메뉴     가격   할인가
0   비빔밥  10000  9000
1  김치찌개   9500  8100
2  된장찌개   8000  7200

In [26]:
# 예: '할인가' 컬럼 삭제
df = df.drop(columns=['할인가'])

In [47]:
# 첫 번째 행(인덱스 0) 전체
row0 = df.loc[0]
#df
#row0

# 인덱스 0~1 범위(끝 포함)
rows_0_to_1 = df.loc[0:1]
#rows_0_to_1

# 조건식: 가격이 9000 이상인 행
rows_price_ge_9000 = df.loc[df['가격'] >= 9000, ['메뉴', '가격', '원산지']]
rows_price_ge_9000

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌개   9000  국내산

In [71]:
# 첫 번째 행(정수 위치 0)
row0_iloc = df.iloc[0]
#row0_iloc
# 첫 2행(0,1)과 앞의 2개 컬럼(0,1)
#sub_iloc = df.iloc[0:2, 0:2]
sub_iloc = df.iloc[0:2, 0:3] #[행:열]
sub_iloc

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌개   9000  국내산

In [76]:
# 가격 오름차순
df_sorted_asc = df.sort_values(by='가격', ascending=True)
#df_sorted_asc

# 가격 내림차순
df_sorted_desc = df.sort_values(by='가격', ascending=False)
df_sorted_desc

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌개   9000  국내산
2  된장찌개   8000  국내산

In [77]:
# 원산지가 국내산이면서 가격이 9000 이상
filtered = df[(df['원산지'] == '국내산') & (df['가격'] >= 9000)]
filtered

     메뉴     가격  원산지
0   비빔밥  10000  국내산
1  김치찌개   9000  국내산

In [78]:
# 컬럼명 일괄 변경 예시
df_renamed = df.rename(columns={'메뉴': 'menu', '가격': 'price', '원산지': 'origin'})
df_renamed

   menu  price origin
0   비빔밥  10000    국내산
1  김치찌개   9000    국내산
2  된장찌개   8000    국내산

In [80]:
fruits = pd.Series(['사과', '바나나', '포도'])
fruits

0     사과
1    바나나
2     포도
dtype: object

In [98]:
df = pd.DataFrame({
    '상품':['키보드','마우스','모니터'],
    '가격':[30000,15000,200000],
    '재고':[10,25,7]
})
df

    상품      가격  재고
0  키보드   30000  10
1  마우스   15000  25
2  모니터  200000   7

In [99]:
prod_s=df['상품']
#prod_s
prod_df=df[['상품']]
prod_df

    상품
0  키보드
1  마우스
2  모니터

In [100]:
price_view=df[['상품','가격']]
price_view

    상품      가격
0  키보드   30000
1  마우스   15000
2  모니터  200000

In [101]:
expensive=df.loc[df['가격']>=20000,['상품','가격']]
expensive

    상품      가격
0  키보드   30000
2  모니터  200000

In [102]:
df.loc[df['상품']=='마우스','가격']=17000
df

    상품      가격  재고
0  키보드   30000  10
1  마우스   17000  25
2  모니터  200000   7

In [104]:
sub_iloc=df.iloc[0:2,0:2]
sub_iloc

    상품     가격
0  키보드  30000
1  마우스  17000

In [107]:
df['부가세포함가'] = (df['가격'] * 1.10).astype(int)
df

    상품      가격  재고  부가세포함가
0  키보드   30000  10   33000
1  마우스   17000  25   18700
2  모니터  200000   7  220000

In [109]:
df_sorted=df.sort_values(by='가격',ascending=True)
df_sorted

    상품      가격  재고  부가세포함가
1  마우스   17000  25   18700
0  키보드   30000  10   33000
2  모니터  200000   7  220000

In [112]:
df_en=df.rename(columns={'상품':'product','가격':'price','재고':'stock'})
df_en

  product   price  stock  부가세포함가
0     키보드   30000     10   33000
1     마우스   17000     25   18700
2     모니터  200000      7  220000